{"modelTopology":{"class_name":"Model","config":{"name":"model1","layers":[{"name":"input1","class_name":"InputLayer","config":{"batch_input_shape":[null,128,128,3],"dtype":"float32","sparse":false,"name":"input1"},"inbound_nodes":[]},{"name":"separable_conv2d_SeparableConv2D1","class_name":"SeparableConv2D","config":{"filters":48,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"separable_conv2d_SeparableConv2D1","trainable":true,"depthwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"pointwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"depthwise_regularizer":null,"pointwise_regularizer":null,"depthwise_constraint":null,"pointwise_constraint":null},"inbound_nodes":[[["input1",0,0,{}]]]},{"name":"conv2d_Conv2D1","class_name":"Conv2D","config":{"filters":192,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[8,8],"strides":[4,4],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D1","trainable":true},"inbound_nodes":[[["separable_conv2d_SeparableConv2D1",0,0,{}]]]},{"name":"permute_Permute1","class_name":"Permute","config":{"dims":[3,1,2],"name":"permute_Permute1","trainable":true},"inbound_nodes":[[["conv2d_Conv2D1",0,0,{}]]]},{"name":"reshape_Reshape1","class_name":"Reshape","config":{"target_shape":[2,2,48,32,32],"name":"reshape_Reshape1","trainable":true},"inbound_nodes":[[["permute_Permute1",0,0,{}]]]},{"name":"permute_Permute2","class_name":"Permute","config":{"dims":[3,4,1,5,2],"name":"permute_Permute2","trainable":true},"inbound_nodes":[[["reshape_Reshape1",0,0,{}]]]},{"name":"reshape_Reshape2","class_name":"Reshape","config":{"target_shape":[48,64,64],"name":"reshape_Reshape2","trainable":true},"inbound_nodes":[[["permute_Permute2",0,0,{}]]]},{"name":"permute_Permute3","class_name":"Permute","config":{"dims":[2,3,1],"name":"permute_Permute3","trainable":true},"inbound_nodes":[[["reshape_Reshape2",0,0,{}]]]},{"name":"permute_Permute4","class_name":"Permute","config":{"dims":[3,1,2],"name":"permute_Permute4","trainable":true},"inbound_nodes":[[["permute_Permute3",0,0,{}]]]},{"name":"reshape_Reshape3","class_name":"Reshape","config":{"target_shape":[2,2,12,64,64],"name":"reshape_Reshape3","trainable":true},"inbound_nodes":[[["permute_Permute4",0,0,{}]]]},{"name":"permute_Permute5","class_name":"Permute","config":{"dims":[3,4,1,5,2],"name":"permute_Permute5","trainable":true},"inbound_nodes":[[["reshape_Reshape3",0,0,{}]]]},{"name":"reshape_Reshape4","class_name":"Reshape","config":{"target_shape":[12,128,128],"name":"reshape_Reshape4","trainable":true},"inbound_nodes":[[["permute_Permute5",0,0,{}]]]},{"name":"permute_Permute6","class_name":"Permute","config":{"dims":[2,3,1],"name":"permute_Permute6","trainable":true},"inbound_nodes":[[["reshape_Reshape4",0,0,{}]]]},{"name":"permute_Permute7","class_name":"Permute","config":{"dims":[3,1,2],"name":"permute_Permute7","trainable":true},"inbound_nodes":[[["permute_Permute6",0,0,{}]]]},{"name":"reshape_Reshape5","class_name":"Reshape","config":{"target_shape":[2,2,3,128,128],"name":"reshape_Reshape5","trainable":true},"inbound_nodes":[[["permute_Permute7",0,0,{}]]]},{"name":"permute_Permute8","class_name":"Permute","config":{"dims":[3,4,1,5,2],"name":"permute_Permute8","trainable":true},"inbound_nodes":[[["reshape_Reshape5",0,0,{}]]]},{"name":"reshape_Reshape6","class_name":"Reshape","config":{"target_shape":[3,256,256],"name":"reshape_Reshape6","trainable":true},"inbound_nodes":[[["permute_Permute8",0,0,{}]]]},{"name":"up_sampling2d_UpSampling2D1","class_name":"UpSampling2D","config":{"size":[2,2],"data_format":"channels_last","name":"up_sampling2d_UpSampling2D1","trainable":true},"inbound_nodes":[[["input1",0,0,{}]]]},{"name":"permute_Permute9","class_name":"Permute","config":{"dims":[2,3,1],"name":"permute_Permute9","trainable":true},"inbound_nodes":[[["reshape_Reshape6",0,0,{}]]]},{"name":"add_Add1","class_name":"Add","config":{"name":"add_Add1","trainable":true},"inbound_nodes":[[["up_sampling2d_UpSampling2D1",0,0,{}],["permute_Permute9",0,0,{}]]]}],"input_layers":[["input1",0,0]],"output_layers":[["add_Add1",0,0]]},"keras_version":"tfjs-layers 1.7.2","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v1.7.2","convertedBy":null,"weightsManifest":[{"paths":["./suprpixl_0.03429.weights.bin"],"weights":[{"name":"separable_conv2d_SeparableConv2D1/depthwise_kernel","shape":[3,3,3,1],"dtype":"float32"},{"name":"separable_conv2d_SeparableConv2D1/pointwise_kernel","shape":[1,1,3,48],"dtype":"float32"},{"name":"separable_conv2d_SeparableConv2D1/bias","shape":[48],"dtype":"float32"},{"name":"conv2d_Conv2D1/kernel","shape":[8,8,48,192],"dtype":"float32"},{"name":"conv2d_Conv2D1/bias","shape":[192],"dtype":"float32"}]}]}